a = {1: ("Анжелика", "Виктория", "Гагарин", "Катарина"), 2: ("Гагарин", "Виктория", "Катарина"),
     3: ("Виктория", "Катарина", "Юбилейная")}
b = {"Анжелика": 0, "Виктория": 0, "Гагарин": 0, "Катарина": 0, "Юбилейная": 0, "Южная": 0}
for item in b.keys():
    for item2 in a.items():
        for item3 in item2[1]:
            if item3 == item:
                b[item] += 1
for item in b.items():
    if item[1] == 0:
        print(item[0], "Нет ни у кого")
    elif 1 <= item[1] <= 2:
        print(item[0], "Есть хотя бы у одного")
    elif item[1] == 3:
        print(item[0], "Есть у всех")
